
  ___  ____  ____  ____  ____ ©
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       SE—Standard Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Single-user , expiring 16 May 2022
Serial number: 401709201735
  Licensed to: Co-Pierre Georg
               University of Cape Town

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000; see help set_maxvar.

. do 14_count_html_noclass.do 

. cd /home/co/git/RegulatoryComplexity_Public/200_analysis
/home/co/git/RegulatoryComplexity_Public/200_analysis

. 
. forval i=1/16 {
  2. insheet using results/html_noclass/cons-count_title_`i'.csv, delimiter(";"
> ) clear
  3.         rename v1 key
  4.         rename v2 category
  5.         rename v3 count
  6. 
.         sort key count
  7. 
.         egen id_key = group(key)
  8.         egen id_category = group(category)
  9. 
.         gen _one = 1
 10. 
.         bysort id_category: egen category_count = sum(count)
 11.         bysort id_category: egen category_unique_count = sum(_one)
 12. 
.         bysort id_key: egen total_count = sum(count)
 13. drop count _one
 14. 
.         bysort id_key: gen _duplicate = _N
 15.         gsort - _duplicate + id_key
 16. 
.         keep category category_count category_unique_count
 17. duplicates drop
 18. 
.         gsort category
 19.         gen title = `i'
 20. outsheet using results/html_noclass/category_cons_count_title_`i'.csv, del
> imiter(";") replace   
 21. save results/html_noclass/category_cons_count_title_`i'.dta, replace
 22. }
(3 vars, 1,938 obs)

Duplicates in terms of all variables

(1,930 observations deleted)
file results/html_noclass/category_cons_count_title_1.dta saved
(3 vars, 2,246 obs)

Duplicates in terms of all variables

(2,238 observations deleted)
file results/html_noclass/category_cons_count_title_2.dta saved
(3 vars, 1,637 obs)

Duplicates in terms of all variables

(1,629 observations deleted)
file results/html_noclass/category_cons_count_title_3.dta saved
(3 vars, 753 obs)

Duplicates in terms of all variables

(745 observations deleted)
file results/html_noclass/category_cons_count_title_4.dta saved
(3 vars, 1,137 obs)

Duplicates in terms of all variables

(1,129 observations deleted)
file results/html_noclass/category_cons_count_title_5.dta saved
(3 vars, 1,663 obs)

Duplicates in terms of all variables

(1,655 observations deleted)
file results/html_noclass/category_cons_count_title_6.dta saved
(3 vars, 3,160 obs)

Duplicates in terms of all variables

(3,152 observations deleted)
file results/html_noclass/category_cons_count_title_7.dta saved
(3 vars, 1,000 obs)

Duplicates in terms of all variables

(992 observations deleted)
file results/html_noclass/category_cons_count_title_8.dta saved
(3 vars, 3,719 obs)

Duplicates in terms of all variables

(3,711 observations deleted)
file results/html_noclass/category_cons_count_title_9.dta saved
(3 vars, 3,962 obs)

Duplicates in terms of all variables

(3,954 observations deleted)
file results/html_noclass/category_cons_count_title_10.dta saved
(3 vars, 1,025 obs)

Duplicates in terms of all variables

(1,017 observations deleted)
file results/html_noclass/category_cons_count_title_11.dta saved
(3 vars, 373 obs)

Duplicates in terms of all variables

(365 observations deleted)
file results/html_noclass/category_cons_count_title_12.dta saved
(3 vars, 267 obs)

Duplicates in terms of all variables

(259 observations deleted)
file results/html_noclass/category_cons_count_title_13.dta saved
(3 vars, 2,919 obs)

Duplicates in terms of all variables

(2,911 observations deleted)
file results/html_noclass/category_cons_count_title_14.dta saved
(3 vars, 785 obs)

Duplicates in terms of all variables

(777 observations deleted)
file results/html_noclass/category_cons_count_title_15.dta saved
(3 vars, 77 obs)

Duplicates in terms of all variables

(70 observations deleted)
file results/html_noclass/category_cons_count_title_16.dta saved

. 
. // join them together
. use results/html_noclass/category_cons_count_title_1.dta, clear

. forval i=2/16 {
  2.         append using results/html_noclass/category_cons_count_title_`i'.dt
> a
  3. }

. outsheet using results/html_noclass/category_cons_count_all_titles.csv, repla
> ce

. 
. 
. 
.         bysort category: egen tot_cat_count = total(category_count)

.         bysort category: egen tot_cat_unique_count = total(category_unique_co
> unt)

. keep category tot_*

. duplicates drop

Duplicates in terms of all variables

(119 observations deleted)

. drop if category == "subprime crisis"  // weird bug
(0 observations deleted)

. outsheet using results/html_noclass/category_cons_count_all_titles-total.csv,
>  replace

. 
. 
. //
. // COMPUTE MOST OCCURRING WORDS
. //
. forval i=1/16 {
  2. insheet using results/html_noclass/cons-count_title_`i'.csv, delimiter(";"
> ) clear
  3.         rename v1 key
  4.         rename v2 category
  5.         rename v3 count
  6. 
.         save ./results/html_noclass/cons-count_title_`i'.dta, replace
  7. }
(3 vars, 1,938 obs)
file ./results/html_noclass/cons-count_title_1.dta saved
(3 vars, 2,246 obs)
file ./results/html_noclass/cons-count_title_2.dta saved
(3 vars, 1,637 obs)
file ./results/html_noclass/cons-count_title_3.dta saved
(3 vars, 753 obs)
file ./results/html_noclass/cons-count_title_4.dta saved
(3 vars, 1,137 obs)
file ./results/html_noclass/cons-count_title_5.dta saved
(3 vars, 1,663 obs)
file ./results/html_noclass/cons-count_title_6.dta saved
(3 vars, 3,160 obs)
file ./results/html_noclass/cons-count_title_7.dta saved
(3 vars, 1,000 obs)
file ./results/html_noclass/cons-count_title_8.dta saved
(3 vars, 3,719 obs)
file ./results/html_noclass/cons-count_title_9.dta saved
(3 vars, 3,962 obs)
file ./results/html_noclass/cons-count_title_10.dta saved
(3 vars, 1,025 obs)
file ./results/html_noclass/cons-count_title_11.dta saved
(3 vars, 373 obs)
file ./results/html_noclass/cons-count_title_12.dta saved
(3 vars, 267 obs)
file ./results/html_noclass/cons-count_title_13.dta saved
(3 vars, 2,919 obs)
file ./results/html_noclass/cons-count_title_14.dta saved
(3 vars, 785 obs)
file ./results/html_noclass/cons-count_title_15.dta saved
(3 vars, 77 obs)
file ./results/html_noclass/cons-count_title_16.dta saved

. 
. use ./results/html_noclass/cons-count_title_1.dta, clear

. forval i=2/16 {
  2. append using ./results/html_noclass/cons-count_title_`i'.dta
  3. }
(variable key was str72, now str106 to accommodate using data's values)
(variable key was str106, now str136 to accommodate using data's values)
(variable key was str136, now str150 to accommodate using data's values)

. 
.         bysort key: egen total_count = sum(count)

.         keep key category total_count

. 
. duplicates drop

Duplicates in terms of all variables

(17,562 observations deleted)

.         gsort + category - total_count

. outsheet using ./results/html_noclass/category_cons_all_titles_most_frequent_
> keys.csv, replace

. 
.         gen one = 1

.         bysort category: egen unique_count = total(one)

. 
.         keep category unique_count 

.         duplicates drop

Duplicates in terms of all variables

(9,091 observations deleted)

.         
. outsheet using ./results/html_noclass/category_unique_count.csv, replace

. 
. insheet using ./results/Master_consolidated+cleaned.csv, clear
(2 vars, 15,661 obs)

.         rename v1 key

.         rename v2 category

.         drop if category == ""
(0 observations deleted)

.         gen one = 1

.         bysort category: egen unique_count = total(one)

. 
.         keep category unique_count 

.         duplicates drop

Duplicates in terms of all variables

(15,654 observations deleted)

.         
. outsheet using ./results/html_noclass/Master_consolidated+cleaned_category_un
> ique_count.csv, replace

. 
end of do-file
